#include<iostream>
#include<vector>
#include<queue>
#include<stdio.h>
#include<algorithm>
#include<stack>

#include "helpvector.h"
using namespace std;
/*************************************************************************************************************************
示例 1：
输入：n = 00000010100101000001111010011100
输出：964176192 (00111001011110000010100101000000)
解释：输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
     因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。
示例 2：
输入：n = 11111111111111111111111111111101
输出：3221225471 (10111111111111111111111111111111)
解释：输入的二进制串 11111111111111111111111111111101 表示无符号整数 4294967293，
     因此返回 3221225471 其二进制表示形式为 10111111111111111111111111111111 。

链接：https://leetcode-cn.com/problems/reverse-bits
*************************************************************************************************************************/
class Solution {
public:
    uint32_t reverseBits(uint32_t n) {
        uint32_t res; 
        for(int i = 0; i < 32; i++){
            res <<= 1;
            res = res | (n&1);
            n = n >> 1;
        }
        return res;
    }
};

int main()
{
    vector<int> vecTreeNode = {1,2,3,4,5,6,7};
    Solution ab;
    uint32_t n = 110;
    uint32_t res = ab.reverseBits(n);
    cout << "res " << endl;
    cout << endl;
    
    return 0;
}

